Repository: chat-sdk/chat-sdk-ios
Catalog: ChatSDKCore/Assets/ChatSDKLocalizable.*.strings
Languages: ar, es, nl

# bLogout
source: Logout
ar: تسجيل الخروج
es: Cerrar sesión
nl: Uitloggen

# bSettings
source: Settings
ar: إعدادات
es: Ajustes
nl: Instellingen

# bLogginIn
source: Logging in
ar: تسجيل الدخول
es: Iniciar sesión
nl: Inloggen

# bProfile
source: Profile
ar: الصفحة الشخصية
es: Perfil
nl: Profiel

# bProfilePictures
source: Profile Pictures
ar: صور الملف الشخصي
es: Fotos de perfil
nl: Profielfoto's

# bAddPicture
source: Add Picture
ar: أضف صورة
es: Añadir una imagen
nl: Een afbeelding toevoegen

# bDeletePicture
source: Delete Picture
ar: احذف الصورة
es: Borrar la imagen
nl: De afbeelding verwijderen

# bSetAsDefaultPicture
source: Set as Default Picture
ar: تعيين كافتراضي
es: Establecer como predeterminado
nl: Als standaard instellen

# bDeleteLastPictureWarning
source: You need to add a new profile picture before deleteing the last picture.
ar: قبل حذف صورتك الأخيرة ، يجب عليك إضافة صورة ملف شخصي جديدة
es: Antes de eliminar su última foto, debe agregar una nueva foto de perfil
nl: Voor je je laatste foto verwijdert moet je een nieuwe profielfoto toevoegen.

# bLoggingOut
source: Logging out
ar: تسجيل الخروج
es: Cerrar sesión
nl: Uitloggen

# bErrorTitle
source: Error
ar: غلطة
nl: Foutje

# bUserCreatedError
source: User could not be created
ar: فشلت إنشاء مستخدم
es: El usuario no pudo ser creado
nl: De gebruiker kon niet aangemaakt worden

# bContacts
source: Contacts
ar: اتصال
es: Contactos
nl: Contacten

# bConversations
source: Conversations
ar: الأحاديث
es: Conversaciones
nl: Gesprekken

# bBroadcast
source: Broadcasts
ar: البث
es: Transmisiones
nl: Uitzendingen

# bThreadCreationError
source: Thread creation failed
ar: هذه المحادثة فشلت
es: Crear sta conversación falló
nl: Dit gesprek aanmaken is mislukt

# bChatRooms
source: Chat Rooms
ar: غرف المحادثة
es: Salas de conversación
nl: Gespreksruimten

# bReset
source: Reset
ar: إعادة تعيين
es: Restablecer
nl: Opnieuw instellen

# bLogin
source: Login
ar: تسجيل الدخول
es: Iniciar sesión

# bRegister
source: Register
ar: بالتسجيل
es: Registrarse
nl: Registreren

# bPassword
source: Password
ar: كلمة المرور
es: Contraseña
nl: Paswoord

# bForgotPassword
source: Forgot password
ar: إعادة تعيين كلمة المرور الخاصة بك
es: Restablece tu contraseña
nl: Je paswoord opnieuw instellen

# bEnterCredentialToResetPassword
source: Enter email to reset password
ar: امنح بريدك الإلكتروني لتجديد كلمة المرور الخاصة بك
es: Dale tu email para renovar tu contraseña
nl: Geef je e-mail om je paswoord te vernieuwen

# bPasswordResetSuccess
source: Your password reset has been successful
ar: تحديث كلمة المرور الخاصة بك قد نجحت
es: La actualización de su contraseña ha tenido éxito
nl: Je paswoord vernieuwen is gelukt

# bBack
source: Back
ar: ظهر
es: Atrás
nl: Terug

# bOpenInMaps
source: Open in maps
ar: افتح في الخرائط
es: Abrir en Mapas
nl: Openen in Maps

# bImageSaved
source: Image saved to library
ar: تم حفظ الصورة
es: La imagen ha sido guardada
nl: De afbeelding is opgeslagen

# bLocation
source: Location
ar: موقع
es: Ubicacion
nl: Plaatsbepaling

# bCompose
source: Compose
ar: كتابة النص
es: Redacción
nl: Opstellen

# bLoadingFriends
source: Loading Friends
ar: أحاول العثور على أصدقائك
es: Ocupado con tus amigos
nl: Bezig met je vrienden op te halen

# bLoading
source: Loading
ar: أنا أعمل!
es: Cargando
nl: Bezig met laden

# bErrorLoadingFriends
source: Error loading friends
ar: أنا لا أجد أصدقائك
es: No puedo recoger a tus amigos
nl: Je vrienden gaven niet thuis

# bInvalidSelection
source: Invalid selection
ar: لا يمكنك اختيار هذا
es: No puedes seleccionar esto
nl: Dit kun je niet kiezen

# bSelectAtLeastOneFriend
source: Select at least one friend
ar: اختر صديق واحد على الأقل
es: Elige al menos un amigo
nl: Kies tenminste één vriend

# bErrorAddingUser_s
source: Error adding %@ to thread
ar: أحصل على أن٪ @ لا تتم إضافة
es: No puedo añadir ese % @
nl: Ik krijg die %@ niet toegevoegd

# bSuccess
source: Success
ar: نجاح
es: Buena suerte
nl: Succes

# bAdded
source: Added
ar: الاضافة
es: Añadido
nl: Toegevoegd

# bAdd
source: Add
ar: اضافة
es: Añadir
nl: Toevoegen

# bCreatingThread
source: Creating thread
ar: مشغول خلق المحادثة
es: Ocupado creando la conversación
nl: Bezig met het aanmaken van het gesprek

# bLogoutErrorTitle
source: Logout error
ar: لقد حدث خطأ في الخروج
es: Salió mal con el cierre de sesión
nl: 't Ging fout met de logout.

# bAuthenticating
source: Authenticating
ar: مشغول مع المصادقة
es: Ocupado con la autentificación
nl: Bezig met de authentificatie

# bOpen
source: Open
ar: فتح
es: Abrir
nl: Openen

# bFlagged
source: Flagged
ar: ملحوظ
es: Marcado
nl: Gemarkeerd

# bFlag
source: Flag
ar: علامة
es: Marcador
nl: Markering

# bDelete
source: Delete
ar: ازالة
es: Verwijderen
nl: Verwijderen

# bUnflag
source: Unflag
ar: إزالة العلامة
es: Borrar marcador
nl: Markering verwijderen

# bSearch
source: Search
ar: بحث
es: Búsqueda
nl: Zoeken

# bSearching
source: Searching
ar: يبحث
es: Buscando
nl: Aan het zoeken

# bAddUsers
source: Add Users
ar: اضافة المستخدمين
es: Añadir usuarios
nl: Gebruikers toevoegen

# bNoNearbyUsers
source: No nearby users
ar: لا احد حولها
es: Nadie alrededor
nl: Niemand in de buurt

source: Online
ar: على الانترنت
es: En linea

source: Offline
ar: متواجد
es: Fuera de linea

# bCreatePublicThread
source: Create public thread
ar: قم بإنشاء محادثة عامة
es: Crear una conversación pública
nl: Publiek gesprek aanmaken

# bThreadName
source: Thread name
ar: اسم المكالمة
es: Nombre de llamada
nl: Gespreksnaam

# bThread
source: Thread
ar: محادثة
es: Conversación
nl: Gesprek

# bCancel
source: Cancel
ar: الغاء
es: Cancelar
nl: Annuleer

# bOk
source: Ok
ar: حسنا
es: De acuerdo
nl: Oké

# bUnableToCreateThread
source: Unable to create thread
ar: لا أستطيع إجراء هذه المحادثة
es: No puedo crear esta conversacion
nl: Het lukt me niet dit gesprek aan te maken

# bChat
source: Chat
ar: المحادثة
es: Chatear

# bOptions
source: Options
ar: خيارات
es: Opciones
nl: Opties

# bChooseExistingPhoto
source: Choose existing photo
ar: اختر صورة موجودة
es: Seleccione una foto existente
nl: Kies een bestaande foto

# bTakePhoto
source: Take photo
ar: التقط صورة
es: Tomar una foto
nl: Neem een foto

# bTakeVideo
source: Take video
ar: اصنع فيديو
es: Hacer un video
nl: Maak een video

# bTakePhotoOrVideo
source: Take photo or video
ar: التقاط صورة أو تجعل شريط فيديو
es: Toma una foto o toma un video
nl: Neem een foto of maak een video

# bChooseExistingVideo
source: Choose existing video
ar: اختر فيديو موجود
es: Seleccione un video existente
nl: Kies een bestaande video

# bCurrentLocation
source: Current location
ar: الموقع الحالي
es: Ubicación actual
nl: Huidige locatie

# bSend
source: Send
ar: إرسال
es: Enviar
nl: Versturen

# bReply
source: Reply
ar: رد
es: Responder
nl: Antwoorden

# bRec
source: Record
ar: سجل
es: Grabar
nl: Opnemen

# bWriteSomething
source: Write something...
ar: ...اكتب شيئًا
es: Escribe algo...
nl: Schrijf iets...

# bSlideToCancel
source: Slide to cancel...
ar: انتقاد لإلغاء ...
es: Desliza para cancelar...
nl: Vegen om te annuleren...

# bName
source: Name
ar: اسم
es: Nombre
nl: Naam

# bTapHereForContactInfo
source: tap here for contact info
ar: اضغط لمزيد من المعلومات
es: Toque para obtener más información de contacto
nl: Tik voor meer contactinformatie

# bPhoneNumber
source: Phone Number
ar: رقم الهاتف
es: Numero de telefono
nl: Telefoonnummer

# bEmail
source: Email
ar: البريد الالكتروني
es: Correo electronico

# bAddParticipant
source: Add Participant
ar: أضف مشارك
es: Añadir un participante
nl: Voeg een deelnemer toe

# bLeaveConversation
source: Leave Conversation
ar: اترك هذه المحادثة
es: Deja esta conversacion
nl: Verlaat dit gesprek

# bRejoinConversation
source: Rejoin Conversation
ar: العودة إلى هذه المحادثة
es: Volver a esta conversacion
nl: Keer terug naar dit gesprek

# bParticipants
source: Participants
ar: المشاركين
es: Participantes
nl: Deelnemers

# bActiveParticipants
source: Active Participants
ar: المشاركون النشطون
es: Participantes activos
nl: Actieve deelnemers

# bNoActiveParticipants
source: No Active Participants
ar: لا أحد نشط
es: Nadie activo
nl: Niemand actief

# bDone
source: Done
ar: استعداد
es: Listo
nl: Klaar

# bEdit
source: Edit
ar: ضبط
es: Personalizar
nl: Aanpassen

# bNoMessages
source: No messages...
ar: لا توجد رسائل ...
es: No hay mensajes...
nl: Geen berichten...

# bGroupName
source: Group Name
ar: اسم المجموعة
es: Nombre del grupo
nl: Groepsnaam

# bLastSeen_at_
source: Last seen %@ at %@
ar: ٪ @ ,٪ @ آخر ظهور على
es: Visto por última vez en % @ en % @
nl: Laatst gezien op %@ om %@

# bToday
source: Today
ar: اليوم
es: Hoy
nl: Vandaag

# bYesterday
source: Yesterday
ar: أمس
es: Ayer
nl: Gisteren

# bSearchTerm
source: Search Term
ar: مصطلح البحث
es: Término de búsqueda
nl: Zoekterm

# bTo
source: To
ar: إلى
es: A
nl: Aan

# bEnterNamesHere
source: Enter names here
ar: أدخل الأسماء هنا
es: Introduce los nombres aquí
nl: Naam hier invullen

# bSearchedContacts
source: Searched contacts
ar: بحثت الاتصالات
es: Contactos buscados
nl: Gezochte contacten

# bNearbyContacts
source: Nearby contacts
ar: اتصالات في الحي
es: Contactos en los alrededores
nl: Contacten in de buurt

# bTyping
source: Typing...
ar: ...كتابة
es: Escribiendo...
nl: Bezig met schrijven...

# bRefreshingUsers
source: Updating...
ar: ...جارٍ تحديث المستخدمين
es: Actualizando usuarios...
nl: Gebruikers bijwerken...

# bSelectYourSearch
source: Select your search
ar: اختر بحثك
es: Seleccione su búsqueda
nl: Kies je opzoeking

# bPhonebook
source: Phonebook
ar: دفتر الهاتف
es: Listín telefónico
nl: Telefoonboek

# bSearchWithName
source: Search with name
ar: البحث بالاسم
es: Búsqueda por nombre
nl: Zoeken volgens naam

# bWarning
source: Warning
ar: تحذير
es: Advertencia
nl: Waarschuwing

# bYouMustEnableContactPermissionsToUseThisFunctionalityEnableInTheSettingsApp
source: You must enable contact permissions to use this functionality. You can change this in Settings
ar: يجب عليك إعطاء إذن لجهات الاتصال الخاصة بك. يمكنك القيام بذلك من خلال الإعدادات
es: Debes dar permiso para tus contactos. Puedes hacer esto en Configuración
nl: Je moet toelating voor je contacten geven. Dit kun je doen bij Instellingen.

# bTermsAndConditions
source: Terms and Conditions
ar: شروط الاستخدام
es: Condiciones de uso
nl: Gebruiksvoorwaarden

# bNoNewUsersFoundForThisSearch
source: No new users found for this search
ar: لم يتم العثور على مستخدمين جدد لهذا البحث
es: No se encontraron nuevos usuarios para esta búsqueda
nl: Geen nieuwe gebruikers gevonden voor deze opzoeking

# bDefaultThreadName
source: Thread
ar: محادثة
es: Conversación
nl: Gesprek

# bHoldToSendAudioMessageError
source: Hold to send audio message. Audio messages must be longer than 1 second
ar: اضغط مع الاستمرار لتسجيل رسالة صوتية أطول من 1 ثانية، وإلا فإنه لن ينجح
es: Mantenga presionado para grabar un mensaje de audio que dura más de 1 segundo, de lo contrario no funcionará
nl: Ingedrukt houden om een audiobericht op te nemen dat langer is dan 1 seconde, anders werkt het niet

# bRecording
source: Recording
ar: التصوير مشغول
es: Grabación
nl: Bezig met de opname

# bSecondsRemaining_
source: Seconds Remaining %i
ar: ٪ iثواني متبقية
es: Segundos restantes %i
nl: Resterende seconden %i

# bCancelled
source: Cancelled
ar: ألغيت
es: Geulizado
nl: Geanulleerd

# bAudioLengthLimitReached
source: Audio Length Limit Reached
ar: يتم التوصل إلى الحد من رسالة الصوت
es: Limita tu mensaje de audio
nl: Limiet van je audiobericht bereikt

# bSendOrDiscardRecording
source: Send or discard recording
ar: إرسال تسجيل أم لا
es: Enviar o cancelar una grabación
nl: Opname versturen of annuleren

# bBlock
source: Block
ar: كتلة
es: Bloquear
nl: Blokkeren

# bUnblock
source: Unblock
ar: فتح
es: Desbloquear
nl: Deblokkeren

# bSave
source: Save
ar: احفظ
es: Guardar
nl: Opslaan

# bSaving
source: Saving
ar: إبقاء مشغول
es: Guardanda
nl: Aan het opslaan

# b_Ago
source: %@ ago
ar: %@ منذ
es: Hace %@
nl: %@ geleden

# b_LeftTheGroup
source: %@ left the group
ar: كان متعبا منا وبعيدا عن المجموعة %@
es: %@ está cansado de nosotros y está fuera del grupo
nl: %@ is ons beu en is weg uit de groep

# b_JoinedTheGroup
source: %@ joined the group
ar: ذهب %@ من المجموعة
es: %@ se ha unido a nuestro grupo
nl: %@ is lid geworden van onze groep

# bCreateGroup
source: Create Group
ar: إنشاء مجموعة
es: Crear un grupo
nl: Maak een groep

# bYouLeftTheGroup
source: You left the group
ar: كنت متعبا منهم، والآن كنت ذهبت
es: Estás cansado de ellos y ahora te has idog
nl: Je bent ze beu en nu ben je weg

# bYouJoinedTheGroup
source: You joined the group
ar: لقد أصبحت عضوًا في المجموعة
es: Te has convertido en un miembro del grupop
nl: Je bent lid geworden van de groep

# bRejoinGroup
source: Rejoin group
ar: تصبح عضوا مرة أخرى
es: Hazte miembro de nuevo
nl: Toch maar terug lid worden

# bDeleteContact
source: Delete Contact
ar: أزل هذا الشخص
es: Eliminar contacto
nl: Contact verwijderen

# bDeleteContactMessage
source: Are you sure you want to delete this contact?
ar: هل أنت متأكد من أنك تريد حذف هذا الشخص؟
es: ¿Estás seguro de que quieres eliminar este contacto?
nl: Ben je zeker dat je dit gesprek wil verwijderen?

# bCamera
source: Camera
ar: كاميرا
es: Camara

# bChoosePhoto
source: Choose Photo
ar: اختر الصورة
es: Seleccione foto

# bChooseVideo
source: Choose Video
ar: اختر فيديو
es: Seleccione un video
nl: Kies een video

# bSticker
source: Sticker
ar: لاصقة
es: Pegatina

# bImageMessagesNotSupported
source: Image messages are not supported
ar: أنا لا أرسل رسائل صور
es: No envío mensajes de imagen
nl: Afbeeldingsberichten versturen doe ik niet

# bAudioMessagesNotSupported
source: Audio messages are not supported
ar: الرسائل الصوتية؟ لا استطيع
es: Mensajes de audio? No puedo
nl: Audioberichten? Kan ik niet

# bStickerMessagesNotSupported
source: Sticker messages are not supported
ar: رسائل مع ملصقات؟ لا استطيع
es: ¿Mensajes con pegatinas? Estoy en huelga
nl: Berichten met stickers? Ik staak

# bLocationMessagesNotSupported
source: Location messages are not supported
ar: إن إرسال مكان ما ليس شيئًا بالنسبة لي
es: Enviar mensajes sobre ubicaciones no es nada para mí
nl: Berichten over locaties versturen is niks voor mij

# bVideoMessagesNotSupported
source: Video messages are not supported
ar: أنا لا أعمل مع رسائل الفيديو
es: No trabajo con mensajes de video
nl: Ik werk niet met videoberichten

# bInviteContact
source: Invite Contact
ar: دعوة جهة اتصال
es: Invitar a un contacto
nl: Nodig een contact uit

# bInviteByEmail
source: Email
ar: البريد الإلكتروني
es: Correo electronico

# bImageMessage
source: 📷 Image Message
ar: صور
es: La imagen
nl: Afbeelding

# bLocationMessage
source: 📍 Location Message
ar: موقع
es: Ubicacion
nl: Plaatsbepaling

# bAudioMessage
source: 🎤 Audio Message
ar: تسجيل صوتي
es: Grabacion de audio
nl: Audio-opname

# bVideoMessage
source: 📹 Video Message
ar: تسجيل الفيديو
es: Grabación de video
nl: Video-opname

# bStickerMessage
source: 😊 Sticker Message
ar: لاصقة
es: Pegatina
nl: Sticker

# bFileMessage
source: 📁 File Message
ar: ملف
es: Archivo
nl: Bestand

# bPhoto
source: Photo
ar: صور
es: Foto
nl: Foto

# bFile
source: File
ar: ملف
es: Archivo
nl: Bestand

# b_at_
source: %@ at %@
es: %@ en %@
nl: %@ om %@
